app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Joe"], ["created_at", "2016-04-21 20:44:24.105039"], ["updated_at", "2016-04-21 20:44:24.105039"]]
---
    def create
      newbie = Customer.create customer_params