app/controllers/sessions_controller.rb

def create
  name = params[:name]
  password = params[:password]
  user = User.find_by({name: name})
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT 1  [["name", "bob"]]