app/controllers/users_controller.rb

def create
  User.create(user_params)
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Bob"], ["password_digest", "$2a$10$QblDOwuK8N9moJk7zi.zAe55Hh9J06dn8BfUe/doVRh4W2lTb..Pe"], ["created_at", "2016-04-20 18:14:40.040596"], ["updated_at", "2016-04-20 18:14:40.040596"]]